/* 
  Localizable.strings
  MergeX

  Created by sylenthwave  on 2021/10/6.
  
*/

"Sunday" = "星期日";
"Monday" = "星期一";
"Tuesday" = "星期二";
"Wednesday" = "星期三";
"Thursday" = "星期四";
"Friday" = "星期五";
"Saturday" = "星期六";

"15 minutes" = "15分钟";
"30 minutes" = "30分钟";
"1 hour" = "1小时";

//MARK: - Home
"Today" = "今天";
"MMMM d" = "M月d日";
"EEEE, MMMM d, yyyy" = "M月d日, EEEE";
"MMMM d, yyyy" = "yyyy年M月d日";
"MMM d" = "M月d日";
"MMM, yyyy" = "yyyy年M月";
"yyyy" = "yyyy年";

"Su" = "日";
"Mo" = "一";
"Tu" = "二";
"We" = "三";
"Th" = "四";
"Fr" = "五";
"Sa" = "六";

"Week %d" = "第%d周";
"Tasks" = "任务";
"Notes" = "笔记";
"%d notes" = "%d条笔记";


"No Tasks" = "今日暂无任务";
"Tap + button to create a new task" = "快去点击 + 号为今天创建第一个任务吧";

"No Note Lists" = "暂无笔记列表";
"Tap + button to create a new note list" = "快去点击 + 号创建一个笔记列表吧";

"No Task Lists" = "暂无清单列表";
"Tap + button to create a new task list" = "快去点击 + 号创建一个清单列表吧";

"No Tags" = "暂无标签";
"Tap + button to create a new tag" = "快去点击 + 号创建一个标签吧";

"No Task Records" = "本周暂无任务记录";

"Count" = "专注次数";
"Durtion" = "专注时长";
"rainbow_focus_times" = "次";
"rainbow_focus_hours" = "小时";

"Focus by %@" =  "%@专注统计";
"Inbox" = "收件箱";
"Lists" = "任务清单";
"Number of tasks" = "任务个数";
"Number of lists" = "清单个数";
"All lists" = "全部清单";
"Number of notes" = "笔记个数";

"Notes List" = "笔记列表";
"All Notes" = "全部笔记";
"全部笔记" = "全部笔记";
"New Note" = "新建笔记";
"Recently" = "最近编辑";
"Recently Edit" = "最近编辑";

"Weekly durtion" = "周任务时长";
"Daily durtion" = "日均时长";
"h" = "小时";
"m" = "分钟";
"s" = "秒";

"Task Duration from %@ to %@" = "%@ - %@ 任务时长统计";

"MergeX" = "MergeX";
"Tags" = "标签";
"Tag" = "标签";

"Note Lists" = "笔记列表";
"Task Lists" = "任务列表";

"Calendar" = "日历";
"List Tasks" = "清单任务";
"Notes" = "笔记";

"Rainbow Focus" = "彩虹专注";
"Task Records" = "任务统计";
"Settings" = "设置";
"Trash" = "回收站";
"Modules" = "模块";
"Others" = "其他";

"Quickly Access" = "快捷访问";

"Today's Focus" = "今日专注时长";
"Today's Focus Hours" = "今日专注时长";
"Today's Focus Times" = "今日专注次数";

"Start focus" = "开始专注";
"Week's Focused" = "本周专注统计";
"focused hours" = "专注时长统计";

"Cancel" = "取消";
"Done" = "完成";

"Open Quickly" = "快速搜索";
"Quickly switch between modules to search for tasks, lists, notes, note lists and tags" = "快速切换模块，搜索任务、清单、笔记、笔记列表及标签";

"Timing" = "正计时";
"Countdown" = "倒计时";
"Start timing focus" = "开始正计时专注";
"Start countdown focus" = "开始倒计时专注";
"Continue" = "继续";
"Pause" = "暂停";
"End" = "结束";
"%d m" = "%d分钟";
"%d h" = "%d小时";
"%dh %dm" = "%d小时%d分钟";

"Focus" = "专注";
"Week" = "本周";
"Year" = "年度";

"Focus Durtion" = "今日专注时长";
"Focus Times" = "今日专注次数";
"Daily Duration" = "日均专注时长";
"Daily Focus Durtion" = "日均专注时长";
"Daily Times" = "日均专注次数";
"Daily Focus Times" = "日均专注次数";

"Focus on categories" = "专注分类统计";
"Total Focus Duration" = "累计专注时长";
"Total Focus Times" = "累计专注次数";
"Weekly focused record" = "每周专注记录";
"Week %d Focus Record" = "第%d周专注记录";

"count_num" = "个";
"day_num" = "天";
"line_num" = "行";

"Total Duration" = "总记录时长";
"Daily Duration" = "日均记录时长";
"Completion" = "已完成";
"Unstart" = "未开始";

"Total task duration" = "任务总时长";
"Total annual tasks" = "年度总任务个数";
"Total assignment days" = "总任务天数";
"Ranking of category tag hours (top three)" = "分类标签时长排行(前三名)";
"Weekly Record" = "每周记录";

"Total number" = "总任务个数";
"Total days" = "累计天数";

"All Tags" = "全部标签";

"Edit Note List" = "编辑笔记列表";
"New Note List" = "新建笔记列表";
"Icon:" = "图标:";
"Name:" = "名称:";

"Edit Task List" = "编辑清单列表";
"New Task List" = "新建清单列表";

"Edit Tag" = "编辑标签";
"New Tag" = "新建标签";
"Icon And Title" = "图标和标题";
"Color" = "颜色";

"Date" = "日期";
"Edit" = "编辑";
"Move" = "移动";
"Delete" = "删除";
"Top" = "置顶";
"Untop" = "取消置顶";
"Restore" = "恢复";
"Add" = "添加";

/// - Task List
"min" = "分钟";
"hour" = "小时";
"hours" = "小时";
"Start Time" = "开始时间";
"Duration" = "持续时长";
"Setup Date" = "添加日期";

"Setup Tag" = "添加标签";
"New Tag" = "添加标签";
"Add+" = "标签+";
"New To-Do" = "新待办事项";
"Setup Tags" = "设置标签";
"New+" = "添加+";

"Time" = "时间";
"Timing" = "计时";
"Timingkeep" = "正在计时";
"Time Periods" = "时间段";
"Only one timed task creation is supported" = "仅支持创建一个计时任务";
"If you want to create a new timed task, please first end the task you are currently performing" = "如果您想创建新的计时任务，请先结束当前正在执行的任务";
"Got it" = "知道了";

"Note Title" = "笔记标题";

"Clear Date" = "清除日期";
"End Repeat" = "结束重复";
"Repeat" = "重复";
"On Date" = "到期结束";
"Never" = "永不结束";
"None" = "无重复";
"Daily" = "每天重复";
"Weekly" = "每周重复";
"Monthly" = "每月重复";
"Yearly" = "每年重复";

"Anytime" = "随时";
"Repeat End Date" = "重复结束日期";
"End Date" = "结束日期";
"minutes" = "分钟";

"Focus Sound" = "选择专注声音";
"Clock" = "时钟";
"Rain" = "雨天";
"Forest" = "森林";
"Waves" = "海浪";
"River" = "河流";
"Fires" = "篝火";
"Birdsong" = "鸟鸣";
"Insects chirping" = "虫鸣";

"Add to note lists" = "添加至笔记列表";
"Add to task lists" = "添加至任务列表";

"Create Time Period Task" = "创建时间段任务";
"Create Timed Tasks" = "创建计时任务";
"Select Task" = "选择任务";
"Archived Tasks" = "查看已归档任务";
"Configure Plugin" = "配置插件";
"Sort By Creation Time" = "按创建时间排序";
"Sort By Update Time" = "按更新时间排序";
"Insert Code Snippet" = "添加代码片段";
"Insert Link" = "添加链接";
"Insert File"  = "添加文件";
"Insert Subpage" = "添加子页面";

/// - Note Actions
"Camera" = "拍照";
"Photo Library" = "相册";
"Recognition" = "文字识别";
"Scanning" = "文档扫描";
"File" = "文件";
"Drawing" = "涂鸦";
"Link" = "链接";
"Code" = "代码块";
"Subpage" = "子页面";

"Title" = "标题";
"Subtitle" = "副标题";
"Heading" = "小标题";
"Strong" = "粗体";
"Body" = "正文";
"Increase" = "向前缩进";
"Decrease" = "向后缩进";
"Indentation" = "缩进";
"Quote" = "引用";

"Checkmark List" = "任务列表";
"Dot List" = "符号列表";
"Number List" = "数字列表";
"Checkmark list" = "任务列表";
"Dot list" = "符号列表";
"Number List" = "数字列表";

"Italic" = "斜体";
"Underlink" = "下划线";
"Striketthrough" = "分割线";
"Alignleft" = "左对齐";
"Aligncenter" = "居中对齐";
"Alignright" = "右对齐";
"Dashed Line" = "虚线分隔";
"Line" = "实线分隔";
"Dot Line" = "点线分割";
"Code Snippe" = "代码片段";
"InlineCode" = "代码块";
"Restore" = "还原";

"Style" = "样式";
"Copy" = "复制";
"Cut" = "剪切";
"Group Images" = "合并图片";
"Layout Images" = "布局";
"Ungroup Images" = "取消合并";
"Paste" = "粘贴";

"Heading Style" = "标题样式";
"List Style" = "列表样式";
"Align Style" = "对齐样式";
"Line Style" = "分割线";
"Text Style" = "文本样式";
"Insert..." = "插入..";

"Focus Settings" = "专注设置";
"Export" = "导出";
"More" = "更多";

"Update Time" = "更新时间";
"Creation Time" = "创建时间";
"Character Count" = "字符数";
"Paragraphs" = "段落";
"Txt" = "纯文本(.Txt)";

"Sound On" = "开启声音";
"Screen Always On" = "屏幕常亮";

/// - Prompt
"‼️ The %@ plugin has been removed" = "‼️已取消「%@」插件";
"🌟 Has used the %@ plugin " = "🌟已使用「%@」插件";
"Deleted %d tasks"= "已删除%@个任务";
"🌟 Has restored %d tasks" =  "🌟已恢复%d个任务";
"🌟 Has remade the home page plugin order" = "🌟已重制首页插件顺序";

"Plugin Sort" = "插件排序";
"Sort" = "排序";

"Tasks added to" = "任务添加至";

/// - Alerts
"The current task is repeating task, should it be deleted" = "当前任务为重复任务，是否删除";
"Delete this occurrence" = "仅删除当前周期任务";
"Delete current and future" = "删除当前及将来周期的任务";
"Delete all" =  "删除所有周期任务";

"Whether to delete the selected tasks" = "是否要删除选中的任务";
"Whether to delete the selected task lists" = "是否要删除选中的清单列表";
"Whether to delete the selected note lists" = "是否要删除选中的笔记列表";
"Whether to delete the selected tags" = "是否要删除选中的标签";


"Focusing time less than one minute will not be recorded, whether to quit focusing" = "专注时长小于一分钟不会被记录，是否退出专注";

"The current tag is the default tag, do you select a tag?" = "当前标签为默认标签，是否选择一个标签？";

"Whether to cancel the %@ plug-in" = "是否取消使用%@插件";
"After canceling the use of the plug-in home quick plug-in area will not display this plug-in" = "取消使用插件后首页快捷插件区将不会显示此插件";

"Continue current timing task?" = "继续当前计时任务?";
"Pause current timing task?" = "暂停当前计时任务?";

"Invalid link" = "链接无效";

"Update Title" = "更新标题";

"Enter link name" = "输入链接地址";

"Whether to delete the current note" = "是否要删除当前的笔记";

"Whether to discard change" = "是否放弃修改";
"Discard" = "放弃";
"Continue" = "继续";

"Whether to add the selected %d tasks to the inbox" = "是否将选中的%d个任务添加到收件箱";

"Archived" = "已归档";
"Clear" = "清空";

//Menu
"Time Or Date" = "时间或日期                ";
"Mark As Completed" = "标记为完成";
"Mark As Canceled" = "取消完成状态";
"Set Tags" = "设置标签";
"Complete" = "完成";
"Open In New Window" = "在新窗口中打开";
"Add to Note Lists" = "添加至笔记列表";
"Add To Task Lists" = "添加至清单列表";
"Add To" = "添加至";
"Operations" = "操作";

"Pin To Top" = "置顶笔记                    ";
"Unpin" = "取消置顶笔记";
"Move To Note Lists" = "移动至笔记列表";

"Edit Task List" = "重新编辑清单列表";
"Edit Note List" = "重新编辑笔记列表";
"Edit Tag" = "重新编辑标签";

"Undo" = "撤销";
"Redo" = "重做";
"Close Window" = "关闭窗口";
"Format" = "格式";
"Restore List" = "还原列表";

/// - Settings for iOS
"Theme" = "主题";
"Badge Count" = "徽章";
"Sound" = "提示音";

"Module Sort" = "模块排序";
"Plugin Sort" = "插件排序";

"Start Week On" = "一周开始于";
"New Task Timeinterval" = "任务默认时间间隔";

"iCloud Sync" = "iCloud同步";
"Create Tutorial Project" = "创建帮助";

"Contact Us" =  "联系我们";
"Rate Us" = "给我们评分";
"Share To Friends" = "推荐给朋友";

"About" = "关于";
"About MergeX" = "关于 MergeX";

"General" = "通用";

"Modules And Plugins" =  "模块与插件";

"Time And Date" = "时间与日期";

"Data Settings" = "数据设置";

"Help & Feedback" = "帮助与反馈";

"On" = "打开";
"Off" = "关闭";

"Completed %@, remaining: %@" = "已完成 %@, 剩余: %@";

"Note Lists Pulgin" = "笔记列表插件";
"Task Lists Pulgin" = "清单列表插件";
"Rainbow Focus Pulgin" = "彩虹专注插件";
"Task Records Pulgin" = "任务统计插件";

/// - Theme
"Classic" = "经典";
"Darkness" = "暗黑";
"Distortion" = "失真";
"Madison" = "麦迪逊";
"Deeply" = "深邃";
"Sunrise" = "朝阳";
"Gruvbox" = "深秋";

"Change Logo" = "更改应用图标";
"Logo" = "应用图标";
